# IsClosedLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsClosedLoop Property
DividedPath Class See Also
---
Whether or not the path forms a closed loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsClosedLoop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsClosedLoop As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsClosedLoop {
	bool get ();
}
```

# Remarks
True if the path form a closed loop. False otherwise.
# See Also
DividedPath Class
Autodesk.Revit.DB Namespace